#include <iostream>

using namespace std;

void main()
{
    // Решите загадку: Сколько чисел от 1 до 1000 содержат как минимум одну цифру 3?
    // Напишите ответ здесь:
    int cnt = 1000 - (9 * 9 * 9);
    cout << cnt << endl;
    // Закомитьте изменения и отправьте их в свой репозиторий.    
}